Table of Contents
 Class Tendon
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Tendon base class
public abstract class Tendon : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Tendon
Derived
BondedTendon
PretensionedTendonGroup
PretensionedTendonGroupItem
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 NumberOfStrand
Number of strands
public int NumberOfStrand { get; set; }
Property Value
int
 Edit this page